from django.contrib import admin
from . import models


# --------------------------------------------------------------- #
# ------------------------- 注册文章标签类 ------------------------- #
# --------------------------------------------------------------- #
admin.site.register(models.Tag)


# --------------------------------------------------------------- #
# ------------------------- 注册分类标签类 ------------------------- #
# --------------------------------------------------------------- #
@admin.register(models.CategoryTag)
class ArticleCategoryTagAdmin(admin.ModelAdmin):
    # ------ 列表页的显示 ------- #

    # 在文章列表页面显示的字段
    list_display = ['category', 'tag']

    # 过滤器
    list_filter = ['category', 'tag']
